Config/Catalogs/ПрофилиИзмененияПлановПоПериодам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПрофилиИзмененияПлановПоПериодам</Name>
			<Comment>(Упр)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодСмещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрофильИзменения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПериода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/ВидыРаспределенияЗначенийБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыРаспределенияЗначенийБюджетирования</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПериодамРавномерно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПериодамСИзменением</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыИзмененийПоПериодамБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыИзмененийПоПериодамБюджетирования</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЦепноеИзменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БазовоеИзменение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ПрофилиИзмененияПлановПоПериодам/Forms/Автозаполнение/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОК(Команда)
	
	ТабИзменения=Новый Соответствие;

	БазовоеЗначение=БазовыйКоэффициент;

	Для Индекс=1 По КоличествоПериодовРаспределения Цикл
		
		НомерПериода=СмещениеПервогоПериодаРаспределения+Индекс-1;

		Если ТипРаспределения=ПредопределенноеЗначение("Перечисление.ВидыРаспределенияЗначенийБюджетирования.ПоПериодамСИзменением") Тогда

			Если ТипИзменения=ПредопределенноеЗначение("Перечисление.ВидыИзмененийПоПериодамБюджетирования.ЦепноеИзменение") Тогда
				БазовоеЗначение=БазовоеЗначение+БазовоеЗначение*ПриращениеЗаПериод;
                Коэффициент=БазовоеЗначение;
			 Иначе
				Коэффициент=БазовоеЗначение+ПриращениеЗаПериод*Индекс;
			КонецЕсли;
		 Иначе
			Коэффициент=1/КоличествоПериодовРаспределения;
 		КонецЕсли;
  		ТабИзменения.Вставить(НомерПериода,Коэффициент);
	КонецЦикла;

	СтруктураИзменений=Новый Структура;

	СтруктураНастройки=Новый Структура;
	СтруктураНастройки.Вставить("БазовыйКоэффициент"					,БазовыйКоэффициент);
	СтруктураНастройки.Вставить("КоличествоПериодовРаспределения"		,КоличествоПериодовРаспределения);
	СтруктураНастройки.Вставить("ПриращениеЗаПериод"					,ПриращениеЗаПериод);
	СтруктураНастройки.Вставить("ТипРаспределения"						,ТипРаспределения);
    СтруктураНастройки.Вставить("СмещениеПервогоПериодаРаспределения"	,СмещениеПервогоПериодаРаспределения);
	СтруктураНастройки.Вставить("ТипИзменения"							,ТипИзменения);

	СтруктураИзменений.Вставить("СтруктураНастроек"	,СтруктураНастройки);
	СтруктураИзменений.Вставить("Данные"	,ТабИзменения);
	
	Закрыть(СтруктураИзменений);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СтруктураНастроек") Тогда
		Если ТипЗнч(Параметры.СтруктураНастроек) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ЭтаФорма,Параметры.СтруктураНастроек);
			СтруктураНастроек = Параметры.СтруктураНастроек;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
